In [1]:
import pandas as pd

df = pd.read_csv("../datasets/employees.csv")
df.head()

   Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT

In [2]:
df.isnull()

    Name    Age  Salary  Department
0  False  False   False       False
1  False  False   False       False
2  False  False   False       False
3  False  False   False       False

In [3]:
df.isnull().sum()

Name          0
Age           0
Salary        0
Department    0
dtype: int64

In [4]:
df.dropna()

   Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT

In [5]:
df["Salary"].fillna(df["Salary"].mean())

0    35000
1    42000
2    30000
3    40000
Name: Salary, dtype: int64

In [6]:
df["Department"].fillna("Unknown")

0       HR
1       IT
2    Sales
3       IT
Name: Department, dtype: str

In [7]:
df["Salary"].fillna(df["Salary"].mean(), inplace=True)

C:\Users\Abhihail Jacob\AppData\Local\Temp\ipykernel_12080\2346652894.py:1: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  df["Salary"].fillna(df["Salary"].mean(), inplace=True)

0    35000
1    42000
2    30000
3    40000
Name: Salary, dtype: int64

In [8]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [9]:
df.duplicated().sum()

np.int64(0)

In [10]:
df.drop_duplicates()

   Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT

In [11]:
df.dtypes

Name            str
Age           int64
Salary        int64
Department      str
dtype: object

In [12]:
df["Salary"] = df["Salary"].astype(float)

In [13]:
df.type

AttributeError: 'DataFrame' object has no attribute 'type'

In [14]:
df.dtypes

Name              str
Age             int64
Salary        float64
Department        str
dtype: object

In [15]:
df["joining_date"] = pd.to_datetime(df["joining_date"])

KeyError: 'joining_date'

In [16]:
df.columns.tolist()

['Name', 'Age', 'Salary', 'Department']

In [17]:
df.columns

Index(['Name', 'Age', 'Salary', 'Department'], dtype='str')

In [18]:
df.dtypes

Name              str
Age             int64
Salary        float64
Department        str
dtype: object